<html><head><META http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>VISHNU D1.1b - Sp&eacute;cifications techniques des besoins</title><link href="style.css" type="text/css" rel="stylesheet"><meta content="DocBook XSL Stylesheets V1.76.1" name="generator"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="book" title="VISHNU D1.1b - Sp&eacute;cifications techniques des besoins"><div class="titlepage"><div><div><h1 class="title"><a name="N2000B"></a>VISHNU D1.1b - Sp&eacute;cifications techniques des besoins</h1></div><div><div class="author"><h3 class="author"><span class="firstname">Benjamin</span> <span class="surname">Isnard</span></h3></div></div><div><div class="author"><h3 class="author"><span class="firstname">Daouda</span> <span class="surname">Traor&eacute;</span></h3></div></div><div><div class="author"><h3 class="author"><span class="firstname">Eug&egrave;ne</span> <span class="surname">Pamba Capo-Chichi</span></h3></div></div><div><div class="revhistory"><table summary="Revision history" width="100%" border="1"><tr><th colspan="3" valign="top" align="left"><b>Revision History</b></th></tr>
      <tr><td align="left">Revision 01</td><td align="left">07/12/2010</td><td align="left">SysFera</td></tr><tr><td colspan="3" align="left">
                    
                <p>Exemple pour validation du format</p></td></tr>
      <tr><td align="left">Revision 02</td><td align="left">14/01/2011</td><td align="left">SysFera</td></tr><tr><td colspan="3" align="left">
              
            <p>Version du livrable</p></td></tr>
    </table></div></div></div><hr></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="chapter"><a href="#N2005E">1. Pr&eacute;sentation du document</a></span></dt><dd><dl><dt><span class="section"><a href="#N20063">Objectifs</a></span></dt><dt><span class="section"><a href="#N2006F">Structure du document</a></span></dt><dt><span class="section"><a href="#N20090">R&eacute;f&eacute;rences</a></span></dt><dt><span class="section"><a href="#N200A5">Glossaire</a></span></dt></dl></dd><dt><span class="chapter"><a href="#N200C7">2. S&eacute;curit&eacute; du syst&egrave;me et des donn&eacute;es</a></span></dt><dd><dl><dt><span class="section"><a href="#N200CD">Tableau des Exigences</a></span></dt><dt><span class="section"><a href="#N20264">Glossaire</a></span></dt></dl></dd><dt><span class="chapter"><a href="#N20293">3. Environnement mat&eacute;riel et logiciel</a></span></dt><dd><dl><dt><span class="section"><a href="#N20299">Tableau des Exigences</a></span></dt><dt><span class="section"><a href="#N20712">Glossaire</a></span></dt></dl></dd><dt><span class="chapter"><a href="#N20726">4. Performances, fiabilit&eacute; et robustesse</a></span></dt><dd><dl><dt><span class="section"><a href="#N2072C">Tableau des Exigences</a></span></dt><dt><span class="section"><a href="#N208C3">Glossaire</a></span></dt></dl></dd></dl></div>
  
  <div class="chapter" title="Chapter&nbsp;1.&nbsp;Pr&eacute;sentation du document"><div class="titlepage"><div><div><h2 class="title"><a name="N2005E"></a>Chapter&nbsp;1.&nbsp;Pr&eacute;sentation du document</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="section"><a href="#N20063">Objectifs</a></span></dt><dt><span class="section"><a href="#N2006F">Structure du document</a></span></dt><dt><span class="section"><a href="#N20090">R&eacute;f&eacute;rences</a></span></dt><dt><span class="section"><a href="#N200A5">Glossaire</a></span></dt></dl></div>
    
    <div class="section" title="Objectifs"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="N20063"></a>Objectifs</h2></div></div></div>
      
      <p>Ce document pr&eacute;sente les sp&eacute;cifications techniques des besoins pour le syst&egrave;me
                Vishnu. Elles sont bas&eacute;es sur les documents de Cahier des charges du
                syst&egrave;me Vishnu (voir R&eacute;f&eacute;rences) et sur la proposition technique de la soci&eacute;t&eacute;
                Sysfera. Ces sp&eacute;cifications incluent les contraintes d'impl&eacute;mentation du
                logiciel. L'objectif principal de ces sp&eacute;cifications est de valider l'ad&eacute;quation de
                la solution propos&eacute;e par rapport aux contraintes de l'environnement d'utilisation.</p>
      <p>Ce document pourra &eacute;galement contenir des pr&eacute;visions sur les &eacute;volutions futures du
                logiciel et pr&eacute;ciser quelles fonctions devraient &ecirc;tre faciles &agrave; ajouter ou
                supprimer.</p>
    </div>
    <div class="section" title="Structure du document"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="N2006F"></a>Structure du document</h2></div></div></div>
      
      <p>Le document est compos&eacute; de 3 parties correspondant &agrave; des domaines techniques
                diff&eacute;rents:</p>
      <div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
          <p>Besoins li&eacute;s &agrave; la s&eacute;curit&eacute; du syst&egrave;me et des donn&eacute;es</p>
        </li><li class="listitem">
          <p>Besoins li&eacute;s &agrave; l'environnement mat&eacute;riel et logiciel</p>
        </li><li class="listitem">
          <p>Besoins en performance, fiabilit&eacute; et robustesse</p>
        </li></ul></div>
      <p>Chaque partie contient un tableau des exigences qui fait l'inventaire des tous les
                besoins techniques concernant le domaine sp&eacute;cifi&eacute;. Ce tableau est suivi d'un
                dictionnaire des termes techniques employ&eacute;s afin de les pr&eacute;ciser le cas
                &eacute;ch&eacute;ant.</p>
    </div>
    <div class="section" title="R&eacute;f&eacute;rences"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="N20090"></a>R&eacute;f&eacute;rences</h2></div></div></div>
      
      <div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
          <p>Cahier des charges pour les services de base de l&rsquo;intergiciel r&eacute;parti VISHNU [EDF R&amp;D, Juillet 2010]</p>
        </li><li class="listitem">
          <p>Compl&eacute;ments au cahier des charges pour les services de base de l&rsquo;intergiciel r&eacute;parti VISHNU [EDF R&amp;D, Ao&ucirc;t 2010]</p>
        </li></ul></div>
    </div>
    <div class="section" title="Glossaire"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="N200A5"></a>Glossaire</h2></div></div></div>
      
      <div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
          <p>UMS ("User Management System"): nom du module Vishnu de gestion des
                        sessions et des utilisateurs</p>
        </li><li class="listitem">
          <p>TMS ("Tasks Management System"): nom du module Vishnu de gestion des
                        t&acirc;ches</p>
        </li><li class="listitem">
          <p>FMS ("Files Management System"): nom du module Vishnu de gestion des
                        transferts de fichiers</p>
        </li><li class="listitem">
          <p>IMS ("Information Management System"): nom du module Vishnu de gestion des
                        informations</p>
        </li></ul></div>
    </div>
  </div>
  <div class="chapter" title="Chapter&nbsp;2.&nbsp;S&eacute;curit&eacute; du syst&egrave;me et des donn&eacute;es"><div class="titlepage"><div><div><h2 class="title"><a name="N200C7"></a>Chapter&nbsp;2.&nbsp;S&eacute;curit&eacute; du syst&egrave;me et des donn&eacute;es</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="section"><a href="#N200CD">Tableau des Exigences</a></span></dt><dt><span class="section"><a href="#N20264">Glossaire</a></span></dt></dl></div>
    
    <div class="section" title="Tableau des Exigences"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="N200CD"></a>Tableau des Exigences</h2></div></div></div>
      
      <div class="informaltable">
        <table border="1"><colgroup><col width="2cm"><col width="4cm"><col width="10cm"></colgroup><thead><tr><th>ID
</th><th>Name
</th><th>Text
</th></tr></thead><tbody><tr><td><p>1</p></td><td><p>Sessions et authentification</p></td><td>&nbsp;</td></tr><tr><td><p>1.1</p></td><td><p>Types d'utilisateurs</p></td><td><p>Les utilisateurs de l&rsquo;intergiciel r&eacute;parti VISHNU seront de deux types : utilisateurs ou administrateurs. Les administrateurs sont des utilisateurs avec des droits suppl&eacute;mentaires. L'identification dans le syst&egrave;me d'un utilisateur se fera &agrave; l'aide d'un login unique et d'un mot de passe qui sera crypt&eacute;. </p></td></tr><tr><td><p>1.2</p></td><td><p>Format des identifiants et mots de passe</p></td><td><p>Le login et le mot de passe respecteront respectivement les expressions r&eacute;guli&egrave;res suivantes:</p><p>^[A-Za-z0-9_]{LOGIN_MIN_SIZE ,LOGIN_MAX_SIZE}$ et ^[^\s]{PASSWORD_MIN_SIZE ,PASSWORD_MAX_SIZE}$</p></td></tr><tr><td><p>1.3</p></td><td><p>Caract&eacute;ristique d'une authentification</p></td><td><p>Une authentification se fait &agrave; l'aide d'un login et d'un mot de passe qui doivent &ecirc;tre au pr&eacute;alable enregistr&eacute;s dans la base de donn&eacute;es pour v&eacute;rification. Le login est unique et le mot de passe enregistr&eacute; est crypt&eacute; en utilisant la fonction crypt de la librairie libcrypt de Linux. La proc&eacute;dure d'authentification est donc s&eacute;curis&eacute;e en ce sens que le login est unique dans la base de donn&eacute;es et que le mot de passe est crypt&eacute; par un algorithme efficace SHA-512. Avant tout ajout d'un nouvel utilisateur via vishnu dans la base de donn&eacute;es le syst&egrave;me v&eacute;rifie que le login n'est pas d&eacute;j&agrave; utilis&eacute;.</p></td></tr><tr><td><p>1.4</p></td><td><p>Authentification unique</p></td><td><p>Une fois authentifi&eacute; dans l&rsquo;intergiciel, l&rsquo;utilisateur n&rsquo;aura plus &agrave; s&rsquo;authentifier pour utiliser les services de l'intergiciel avec son propre compte. Un identifiant de session sera cr&eacute;&eacute; par le syst&egrave;me et retourn&eacute; &agrave; l'utilisateur. Cet identifiant est ensuite enregistr&eacute; dans une variable VISHNU_SESSION_ID pour &eacute;viter d'avoir &agrave; fournir cette information pour chaque requ&ecirc;te (dans le cadre du client shell Unix). La complexit&eacute; de cet identifiant garantit son unicit&eacute; mais surtout un niveau de s&eacute;curit&eacute; pour une utilisation du syst&egrave;me sans authentification syst&eacute;matique. </p></td></tr><tr><td><p>1.5</p></td><td><p>Fermeture de session</p></td><td>&nbsp;</td></tr><tr><td><p>1.5.1</p></td><td><p>Fermeture manuelle de session</p></td><td><p>L'utilisateur peut fermer manuellement la session dans laquelle il se trouve. Avant la fermeture, le syst&egrave;me v&eacute;rifie la pr&eacute;sence de commandes en cours d'ex&eacute;cution dans la session. Si il existe une ou plusieurs commandes en cours d'ex&eacute;cution le syst&egrave;me rend impossible la fermeture de session sinon la session est ferm&eacute;e. Cette fermeture est possible en utilisant l'identifiant de session d&eacute;fini dans la variable VISHNU_SESSION_ID. </p></td></tr><tr><td><p>1.5.2</p></td><td><p>Choix de l'option de fermeture automatique de session</p></td><td><p>L'utilisateur peut choisir entre deux options de fermeture automatique de session: soit l'option de fermeture &agrave; la d&eacute;connexion du terminal, soit l'option de fermeture apr&egrave;s expiration du d&eacute;lai d'inactivit&eacute; (p&eacute;riode sans aucun appel aux services de l'intergiciel). Le choix est enregistr&eacute; dans la configuration permanente de l'utilisateur et peut &eacute;galement &ecirc;tre modifi&eacute; pour une session donn&eacute;e. Le choix de fermeture &agrave; la d&eacute;connexion du terminal n'est possible que dans le cas d'une session de type "shell unix". Dans les deux cas, la pr&eacute;sence de commandes en cours d'ex&eacute;cution rend impossible la fermeture de session. Par contre, pour l'option de fermeture apr&egrave;s expiration du d&eacute;lai d'inactivit&eacute;, il y a une r&eacute;initialisation du d&eacute;lai d'inactivit&eacute; lorsqu'il y a des commandes en cours d'ex&eacute;cution.</p></td></tr><tr><td><p>1.5.3</p></td><td><p>V&eacute;rification des commandes en cours avant fermeture de session</p></td><td><p>Le syst&egrave;me v&eacute;rifie que toutes les commandes lanc&eacute;es pendant la session sont termin&eacute;es avant de fermer la session. Dans le cas o&ugrave; l'utilisateur s'est d&eacute;connect&eacute; de son terminal et que la session doit &ecirc;tre ferm&eacute;e automatiquement, la session ne sera pas ferm&eacute;e avant la fin de l'ex&eacute;cution de toutes les commandes en cours, et elle sera ferm&eacute;e apr&egrave;s expiration du d&eacute;lai d'inactivit&eacute;.</p></td></tr><tr><td><p>1.6</p></td><td><p>Reconnection &agrave; une session</p></td><td><p>Un utilisateur peut se connecter &agrave; une session d&eacute;j&agrave; ouverte sur la m&ecirc;me machine cliente en fournissant un identifiant unique de session ainsi que son login et mot de passe. S'il se trouve d&eacute;j&agrave; dans une session ouverte, le syst&egrave;me lui propose de fermer cette session ou bien de la conserver ouverte avec une d&eacute;connexion automatique au bout du temps maximum d'inactivit&eacute;.</p></td></tr><tr><td><p>1.7</p></td><td><p>Acc&egrave;s aux informations sur les sessions</p></td><td><p>Pour un utilisateur normal, l'affichage des sessions (actives ou ferm&eacute;es) n'est possible qu'apr&egrave;s une authentification &agrave; partir du login et du mot de passe de l'utilisateur. Un administrateur peut par contre acc&eacute;der &agrave; toutes les informations de sessions de tous les utilisateurs.</p></td></tr><tr><td><p>1.8</p></td><td><p>Acc&egrave;s aux machines</p></td><td>&nbsp;</td></tr><tr><td><p>1.8.1</p></td><td><p>Cr&eacute;ation et modification d'acc&egrave;s</p></td><td><p>L'acc&egrave;s &agrave; une machine au travers de l'intergiciel Vishnu se fera &agrave; l'aide d'un couple cl&eacute; SSH priv&eacute;e/publique sp&eacute;cifique &agrave; chaque couple (machine, utilisateur). L'utilisateur du syst&egrave;me Vishnu devra ajouter la clef publique aux clefs autoris&eacute;es sur son compte Unix.</p></td></tr><tr><td><p>1.8.2</p></td><td><p>R&eacute;vocation d'un acc&egrave;s au compte unix par un utilisateur</p></td><td><p>L'utilisateur pour supprimer l'acc&egrave;s au travers de l'intergiciel Vishnu &agrave; son compte Unix sur une machine donn&eacute;e en supprimant simplement la clef publique de la liste des cles autoris&eacute;es sur son compte.</p></td></tr><tr><td><p>1.8.3</p></td><td><p>Respect des autorisations d'acc&egrave;s</p></td><td><p>L'acc&egrave;s au compte de l'utilisateur sur une machine et aux informations y &eacute;tant stock&eacute;es se faisant via SSH avec le compte de l'utilisateur, tous les droits d'acc&egrave;s syst&egrave;me seront respect&eacute;s.</p></td></tr><tr><td><p>1.8.4</p></td><td><p>Utilisation de comptes individuels</p></td><td><p>Un utilisateur Vishnu ne peut enregistrer un compte Unix sur une machine donn&eacute;e que si ce compte n'est pas d&eacute;j&agrave; utilis&eacute; par un autre utilisateur Vishnu. Si c'est le cas, le syst&egrave;me Vishnu doit refuser la cr&eacute;ation (ou modification) de l'acc&egrave;s &agrave; la machine.</p></td></tr><tr><td><p>1.9</p></td><td><p>Changement de mot de passe</p></td><td><p>Un utilisateur peut modifier son mot de passe lorsqu'il a d&eacute;j&agrave; ouvert une session. Le nouveau mot de passe est actif imm&eacute;diatement c'est-&agrave;-dire que toute nouvelle authentification se fera avec le nouveau mot de passe.</p></td></tr><tr><td><p>2</p></td><td><p>S&eacute;curit&eacute; des communications</p></td><td>&nbsp;</td></tr><tr><td><p>2.1</p></td><td><p>Donn&eacute;es des requ&ecirc;tes au syst&egrave;me</p></td><td><p>Les requ&ecirc;tes au syst&egrave;me vishnu sont authentifi&eacute;es mais non crypt&eacute;es.</p></td></tr><tr><td><p>2.2</p></td><td><p>Communications &agrave; travers un firewall</p></td><td><p>Les communications entre machines du syst&egrave;me Vishnu pourront &ecirc;tre configur&eacute;es pour traverser un firewall permettant les communications crypt&eacute;es.</p></td></tr><tr><td><p>2.3</p></td><td><p>Fichiers des utilisateurs</p></td><td><p>Les fichiers des utilisateurs sont transf&eacute;r&eacute;s en utilisant le cryptage SSH avec les clefs de l'utilisateur. Pour qu'un transfert puisse avoir lieu entre deux machines l'utilisateur doit avoir configur&eacute; ses clefs SSH (ind&eacute;pendamment de Vishnu) pour permettre une communication entre ces deux machines.</p></td></tr><tr><td><p>2.4</p></td><td><p>Informations stock&eacute;es par le syst&egrave;me</p></td><td><p>Le syst&egrave;me Vishnu stockera toutes les informations relatives aux utilisateurs, aux t&acirc;ches, transferts de fichiers, mesures de performance et trace des requ&ecirc;tes dans une base de donn&eacute;es PostgreSQL sans &ecirc;tre crypt&eacute;es. L'acc&egrave;s du syst&egrave;me Vishnu &agrave; la base de donn&eacute;es sera authentifi&eacute; par login/mot de passe dont l'envoi au travers de la connexion sera r&eacute;alis&eacute; apr&egrave;s hachage MD5. Les communications entre le syst&egrave;me Vishnu et la base de donn&eacute;es pourront &ecirc;tre crypt&eacute;es si n&eacute;cessaires par le protocole SSL en configurant le syst&egrave;me Vishnu et la base de donn&eacute;es.</p></td></tr><tr><td><p>3</p></td><td><p>S&eacute;curit&eacute; des fonctions administrateurs</p></td><td>&nbsp;</td></tr><tr><td><p>3.1</p></td><td><p>Configuration de l'option par d&eacute;faut de fin de session</p></td><td><p>Un administrateur peut d&eacute;finir quelle est l'option par d&eacute;faut pour la fermeture automatique d'une session utilisateur: soit terminaison en cas de d&eacute;connexion de l'utilisateur du client, soit terminaison apr&egrave;s expiration du d&eacute;lai d'inactivit&eacute;</p></td></tr><tr><td><p>3.2</p></td><td><p>Utilisation d'un compte tiers</p></td><td><p>Un administrateur de l&rsquo;intergiciel pourra ouvrir une session VISHNU avec le compte d&rsquo;un utilisateur n&rsquo;&eacute;tant pas administrateur lui-m&ecirc;me.</p></td></tr></tbody></table>
      </div>
    </div>
    <div class="section" title="Glossaire"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="N20264"></a>Glossaire</h2></div></div></div>
      
      <div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
            <p><span class="bold"><strong>Firewall (ou pare-feu en fran&ccedil;ais)</strong></span>: est un mat&eacute;riel ou un logiciel
qui impose une politique de s&eacute;curit&eacute; 
pour prot&eacute;ger un r&eacute;seau en constituant une
barri&egrave;re (un filtre) avec d'autres r&eacute;seaux.</p>
          </li><li class="listitem">
            <p><span class="bold"><strong>MD5</strong></span>: est un acronyme de Message Digest 5. 
C'est une fonction de hachage cryptographique.</p>
          </li><li class="listitem">
            <p><span class="bold"><strong>SHA-512</strong></span>: SHA-512 est un acronyme de Secure Hash Algorithm avec une empreinte de 512 bits. C'est une fonction de hachage cryptographique d&eacute;riv&eacute;e
de SHA-1.</p>
          </li><li class="listitem">
            <p><span class="bold"><strong>SSH</strong></span>: &agrave; la fois programme ex&eacute;cutable et protocole de communication s&eacute;curis&eacute; utilisant un &eacute;change de cl&eacute;s de chiffrement en d&eacute;but de connexion.</p>
          </li></ul></div>
    </div>
  </div>
  <div class="chapter" title="Chapter&nbsp;3.&nbsp;Environnement mat&eacute;riel et logiciel"><div class="titlepage"><div><div><h2 class="title"><a name="N20293"></a>Chapter&nbsp;3.&nbsp;Environnement mat&eacute;riel et logiciel</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="section"><a href="#N20299">Tableau des Exigences</a></span></dt><dt><span class="section"><a href="#N20712">Glossaire</a></span></dt></dl></div>
    
    <div class="section" title="Tableau des Exigences"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="N20299"></a>Tableau des Exigences</h2></div></div></div>
      
      <div class="informaltable">
        <table border="1"><colgroup><col width="2cm"><col width="4cm"><col width="10cm"></colgroup><thead><tr><th>ID
</th><th>Name
</th><th>Text
</th></tr></thead><tbody><tr><td><p>1.</p></td><td><p>Plateformes support&eacute;es</p></td><td>&nbsp;</td></tr><tr><td><p>1.1</p></td><td><p>Machines clientes</p></td><td>&nbsp;</td></tr><tr><td><p>1.1.1</p></td><td><p>Syst&egrave;me d'exploitation</p></td><td><p>Debian Linux v5 (Lenny) ou ult&eacute;rieure</p></td></tr><tr><td><p>1.1.2</p></td><td><p>Architecture mat&eacute;rielle</p></td><td><p>Intel x86</p></td></tr><tr><td><p>1.1.3</p></td><td><p>Nombre et vitesse des processeurs</p></td><td><p>Monoprocesseur ou multiprocesseur, 2GHz minimum</p></td></tr><tr><td><p>1.1.4</p></td><td><p>M&eacute;moire vive</p></td><td><p>Minimum 1Go</p></td></tr><tr><td><p>1.1.5</p></td><td><p>Espace disque</p></td><td><p>Minimum 1Go disponible</p></td></tr><tr><td><p>1.1.6</p></td><td><p>Logiciels requis</p></td><td><p>SysFera DS, OmniORB, SSH (client/serveur), RSync</p></td></tr><tr><td><p>1.1.7</p></td><td><p>Variables d'environnement</p></td><td><p>La cl&eacute; RSA ou DSA du serveur SSH (chemin complet sur la cl&eacute; publique) afin d'identifier le client</p></td></tr><tr><td><p>1.1.8</p></td><td><p>Interface r&eacute;seau</p></td><td><p>Adresse IP dynamique et nom DNS dynamique</p></td></tr><tr><td><p>1.2</p></td><td><p>Serveurs de calcul ou de stockage</p></td><td>&nbsp;</td></tr><tr><td><p>1.2.1</p></td><td><p>Syst&egrave;me d'exploitation</p></td><td><p>Debian Linux v5 (Lenny) ou ult&eacute;rieure</p></td></tr><tr><td><p>1.2.2</p></td><td><p>Architecture mat&eacute;rielle</p></td><td><p>Intel x86 ou IBM BlueGene/P&reg; (PPC 32-bits)</p></td></tr><tr><td><p>1.2.3</p></td><td><p>Nombre et vitesse des processeurs</p></td><td><p>Monoprocesseur ou multiprocesseur, 2GHz minimum</p></td></tr><tr><td><p>1.2.4</p></td><td><p>M&eacute;moire vive</p></td><td><p>Minimum 1Go</p></td></tr><tr><td><p>1.2.5</p></td><td><p>Espace disque</p></td><td><p>Minimum 10 Go disponible</p></td></tr><tr><td><p>1.2.6</p></td><td><p>Logiciels de gestion de jobs batch support&eacute;s</p></td><td><p>- Torque </p><p>- IBM LoadLeveler</p></td></tr><tr><td><p>1.2.7</p></td><td><p>Logiciels requis</p></td><td><p>SysFera DS, OmniORB, SSH (client/serveur), RSync, Client database (Oracle ou PostGreSQL)</p></td></tr><tr><td><p>1.2.8</p></td><td><p>Ports pour tunnel(s) SSH</p></td><td><p>1 port r&eacute;seau disponible pour un tunnel SSH si serveur plac&eacute; derri&egrave;re un firewall</p></td></tr><tr><td><p>1.2.9</p></td><td><p>Interface r&eacute;seau</p></td><td><p>Adresse IP et nom DNS statiques</p></td></tr><tr><td><p>1.3</p></td><td><p>Serveurs d&eacute;di&eacute;s VISHNU</p></td><td>&nbsp;</td></tr><tr><td><p>1.3.1</p></td><td><p>Nombre de serveurs</p></td><td><p>Au minimum 2 serveurs d&eacute;di&eacute;s. Un ratio de 1 serveur suppl&eacute;mentaire pour 5 serveurs de calcul ou stockage est conseill&eacute;.</p></td></tr><tr><td><p>1.3.2</p></td><td><p>Plateforme</p></td><td>&nbsp;</td></tr><tr><td><p>1.3.2.1</p></td><td><p>Syst&egrave;me d'exploitation</p></td><td><p>Debian Linux v5 (Lenny) ou ult&eacute;rieure</p></td></tr><tr><td><p>1.3.2.2</p></td><td><p>Architecture mat&eacute;rielle</p></td><td><p>Intel x86</p></td></tr><tr><td><p>1.3.2.3</p></td><td><p>Nombre et vitesse des processeurs</p></td><td><p>Monoprocesseur ou multiprocesseur, 2GHz minimum</p></td></tr><tr><td><p>1.3.2.4</p></td><td><p>M&eacute;moire vive</p></td><td><p>Minimum 2 Go</p></td></tr><tr><td><p>1.3.2.5</p></td><td><p>Espace disque</p></td><td><p>Minimum 10 Go disponibles</p></td></tr><tr><td><p>1.3.2.6</p></td><td><p>Ports pour tunnel(s) SSH</p></td><td><p>N ports r&eacute;seau disponibles pour un/des tunnel(s) SSH o&ugrave; N est le nombre de serveurs de calcul ou de stockage plac&eacute;s derri&egrave;re un firewall.</p></td></tr><tr><td><p>1.3.2.7</p></td><td><p>Interface r&eacute;seau</p></td><td><p>Adresse IP et nom DNS statiques</p></td></tr><tr><td><p>1.4</p></td><td><p>Serveur Web (pour API Web Services)</p></td><td>&nbsp;</td></tr><tr><td><p>1.4.1</p></td><td><p>Plateforme</p></td><td>&nbsp;</td></tr><tr><td><p>1.4.1.1</p></td><td><p>Syst&egrave;me d'exploitation</p></td><td><p>Debian Linux v5 (Lenny) ou ult&eacute;rieure</p></td></tr><tr><td><p>1.4.1.2</p></td><td><p>Architecture mat&eacute;rielle</p></td><td><p>Intel x86</p></td></tr><tr><td><p>1.4.1.3</p></td><td><p>Nombre et vitesse des processeurs</p></td><td><p>Monoprocesseur ou multiprocesseur, 2GHz minimum</p></td></tr><tr><td><p>1.4.1.4</p></td><td><p>M&eacute;moire vive</p></td><td><p>Minimum 2Go</p></td></tr><tr><td><p>1.4.1.5</p></td><td><p>Espace disque</p></td><td><p>Minimum 500 Go (espace n&eacute;cessaire au stockage de fichiers temporaires)</p></td></tr><tr><td><p>1.4.1.6</p></td><td><p>Interface r&eacute;seau</p></td><td><p>Adresse IP et nom DNS statiques </p></td></tr><tr><td><p>1.4.2</p></td><td><p>Standard de publication des services web</p></td><td><p>WSDL 1.1</p></td></tr><tr><td><p>1.4.3</p></td><td><p>Machine virtuelle Java</p></td><td><p>Java SDK v1.6.0 ou ult&eacute;rieure</p></td></tr><tr><td><p>1.4.4</p></td><td><p>Serveur web d'applications</p></td><td><p>JBoss AS 5.1.0 ou ult&eacute;rieure</p></td></tr><tr><td><p>1.4.5</p></td><td><p>Module Web Services</p></td><td><p>Module JBossWS version Stack CXF Server 3.3.1.GA ou ult&eacute;rieure</p></td></tr><tr><td><p>1.4.6</p></td><td><p>Autres logiciels requis</p></td><td><p>SysFera DS, OmniORB, SSH (client/serveur), RSync</p></td></tr><tr><td><p>1.5</p></td><td><p>Serveur de Base de donn&eacute;es</p></td><td>&nbsp;</td></tr><tr><td><p>1.5.1</p></td><td><p>Plateforme</p></td><td>&nbsp;</td></tr><tr><td><p>1.5.1.1</p></td><td><p>Syst&egrave;me d'exploitation</p></td><td><p>Debian Linux v5 (Lenny) ou ult&eacute;rieure</p></td></tr><tr><td><p>1.5.1.2</p></td><td><p>Architecture mat&eacute;rielle</p></td><td><p>Intel x86</p></td></tr><tr><td><p>1.5.1.3</p></td><td><p>M&eacute;moire vive</p></td><td><p>Minimum 2Go</p></td></tr><tr><td><p>1.5.1.4</p></td><td><p>Nombre et vitesse des processeurs</p></td><td><p>Monoprocesseur ou multiprocesseur, 2GHz minimum</p></td></tr><tr><td><p>1.5.1.5</p></td><td><p>Espace disque</p></td><td><p>Minimum 500 Go</p></td></tr><tr><td><p>1.5.1.6</p></td><td><p>Ports pour tunnel(s) SSH</p></td><td><p>N ports r&eacute;seau disponibles pour un/des tunnel(s) SSH o&ugrave; N est le nombre de serveurs de calcul ou de stockage plac&eacute;s derri&egrave;re un firewall.</p></td></tr><tr><td><p>1.5.1.7</p></td><td><p>Interface r&eacute;seau</p></td><td><p>Adresse IP et nom DNS statiques</p></td></tr><tr><td><p>1.5.2</p></td><td><p>SGBD support&eacute;s</p></td><td><p>L'un des deux SGBD suivantes doit &ecirc;tre install&eacute;:</p><p>- PostGreSQL version 8.0 ou ult&eacute;rieure</p><p>- Oracle Database 11g (v11.1.0.6 minimum)</p></td></tr><tr><td><p>1.5.3</p></td><td><p>R&eacute;plication de la base de donn&eacute;es</p></td><td><p>Afin de garantir un temps de r&eacute;ponse maximum aux requ&ecirc;tes des machines de la plate-forme VISHNU, la base de donn&eacute;e pourra &ecirc;tre r&eacute;pliqu&eacute;e selon une architecture ma&icirc;tre-esclave (&eacute;criture sur un seul serveur, lecture sur plusieurs serveurs).</p></td></tr><tr><td><p>1.6</p></td><td><p>Infrastructure r&eacute;seau</p></td><td>&nbsp;</td></tr><tr><td><p>1.6.1</p></td><td><p>Connexion entre serveurs (calcul/stockage/VISHNU) et serveur de base de donn&eacute;es</p></td><td>&nbsp;</td></tr><tr><td><p>1.6.1.1</p></td><td><p>D&eacute;bit</p></td><td><p>Minimum 100Mb/s</p></td></tr><tr><td><p>1.6.1.2</p></td><td><p>Temps de r&eacute;ponse</p></td><td><p>Maximum 100ms</p></td></tr><tr><td><p>1.6.1.3</p></td><td><p>Protocoles autoris&eacute;s</p></td><td><p>TCP SSH (port 22) minimum</p></td></tr><tr><td><p>1.6.2</p></td><td><p>Connexion entre clients (ou serveur web) et serveurs (calcul/stockage/VISHNU)</p></td><td>&nbsp;</td></tr><tr><td><p>1.6.2.1</p></td><td><p>D&eacute;bit</p></td><td><p>Minimum 10Mb/s</p></td></tr><tr><td><p>1.6.2.2</p></td><td><p>Temps de r&eacute;ponse</p></td><td><p>Maximum 200ms</p></td></tr><tr><td><p>1.6.2.3</p></td><td><p>Protocoles autoris&eacute;s</p></td><td><p>TCP SSH (port 22) minimum</p></td></tr><tr><td><p>2.</p></td><td><p>Versions des logiciels requis</p></td><td>&nbsp;</td></tr><tr><td><p>2.1</p></td><td><p>SSH</p></td><td><p>serveur ssh et client ssh - version minimum TBD</p></td></tr><tr><td><p>2.2</p></td><td><p>CORBA</p></td><td><p>OmniORB v4.1.4 minimum</p></td></tr><tr><td><p>2.3</p></td><td><p>Librairie BOOST C++</p></td><td><p>v1.45 minimum</p></td></tr><tr><td><p>2.4</p></td><td><p>Librairies des Batch schedulers</p></td><td><p>Torque API / LoadLeveler API</p></td></tr><tr><td><p>2.5</p></td><td><p>Logiciels de transferts de fichiers</p></td><td><p>RSync v3.0 ou ult&eacute;rieure</p></td></tr><tr><td><p>2.6</p></td><td><p>SysFera-DS</p></td><td><p>Une version de SysFera-DS sup&eacute;rieure ou &eacute;gale &agrave; 2.6 et strictement inf&eacute;rieure &agrave; la version 3.0 doit &ecirc;tre disponible</p></td></tr><tr><td><p>2.7</p></td><td><p>Modules SysFera-DS</p></td><td><p>Le module LogService de SysFera-DS devra faire partie de l'installation de SysFera-DS.</p></td></tr><tr><td><p>2.8</p></td><td><p>Client database</p></td><td><p>- Oracle Database Client 11g (v11.1.0.6 minimum)</p><p>- PostgreSQL client v8.0</p></td></tr><tr><td><p>3.</p></td><td><p>Outils de compilation</p></td><td>&nbsp;</td></tr><tr><td><p>3.1</p></td><td><p>CMake</p></td><td><p>CMake v2.6 minimum</p></td></tr><tr><td><p>3.2</p></td><td><p>GCC</p></td><td><p>GCC v4.4.3 minimum (Janvier 2010)</p></td></tr></tbody></table>
      </div>
    </div>
    <div class="section" title="Glossaire"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="N20712"></a>Glossaire</h2></div></div></div>
      
      <div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
            <p><span class="bold"><strong>SGBD</strong></span>: (Syst&egrave;me de gestion de bases de donn&eacute;es, en anglais DBMS)</p>
          </li></ul></div>
    </div>
  </div>
  <div class="chapter" title="Chapter&nbsp;4.&nbsp;Performances, fiabilit&eacute; et robustesse"><div class="titlepage"><div><div><h2 class="title"><a name="N20726"></a>Chapter&nbsp;4.&nbsp;Performances, fiabilit&eacute; et robustesse</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="section"><a href="#N2072C">Tableau des Exigences</a></span></dt><dt><span class="section"><a href="#N208C3">Glossaire</a></span></dt></dl></div>
    
    <div class="section" title="Tableau des Exigences"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="N2072C"></a>Tableau des Exigences</h2></div></div></div>
      
      <div class="informaltable">
        <table border="1"><colgroup><col width="2cm"><col width="4cm"><col width="10cm"></colgroup><thead><tr><th>ID
</th><th>Name
</th><th>Text
</th></tr></thead><tbody><tr><td><p>1</p></td><td><p>Fiabilit&eacute;</p></td><td>&nbsp;</td></tr><tr><td><p>1.1</p></td><td><p>R&eacute;ponse aux requ&ecirc;tes</p></td><td><p>Toute requ&ecirc;te lanc&eacute;e &agrave; travers le syst&egrave;me Vishnu conduit &agrave; une r&eacute;ponse. Cette r&eacute;ponse peut  &ecirc;tre soit le r&eacute;sultat pr&eacute;vu, soit un message d'erreur. </p><p>Pour chaque message d'erreur, le syst&egrave;me vishnu associe un code d'erreur (type entier) correspondant. Un code &eacute;gal &agrave; zero correspondra &agrave; un r&eacute;sultat correct. Les interfaces de programmation de Vishnu fourniront un m&eacute;canisme d'exceptions permettant &agrave; l'utilisateur de traiter s&eacute;par&eacute;ment les erreurs selon leur cause.</p></td></tr><tr><td><p>1.2</p></td><td><p>Enregistrement des requ&ecirc;tes</p></td><td><p>Le syst&egrave;me Vishnu conserve la trace de chaque requ&ecirc;te utilisateur dans une base de donn&eacute;es. Cette trace comprend les identifiants de l'utilisateur et de la machine cliente, le nom de la commande ayant permis le lancement de la requ&ecirc;te et les param&egrave;tres de la requ&ecirc;te. Dans le cas d'une requ&ecirc;te soumise via l'API Web Services, la machine cliente sera le serveur web lui-m&ecirc;me.</p></td></tr><tr><td><p>1.3</p></td><td><p>Reproductibilit&eacute; des requ&ecirc;tes</p></td><td><p>Le syst&egrave;me Vishnu peut r&eacute;-executer une ou plusieurs requ&ecirc;tes &agrave; partir des traces enregistr&eacute;es. Pour chaque requ&ecirc;te, les param&egrave;tres de la requ&ecirc;te seront les m&ecirc;mes que lors de la soumission initiale &agrave; l'exception de l'utilisateur et de la machine cliente qui proviendront de la session courante (remarque: un administrateur peut ouvrir une session en tant qu'un autre utilisateur).</p></td></tr><tr><td><p>1.4</p></td><td><p>Erreurs dues &agrave; l'infrastructure</p></td><td><p>Lorsqu'une machine de l'infrastructure est arr&ecirc;t&eacute;e ou injoignable le syst&egrave;me r&eacute;pond aux requ&ecirc;tes des utilisateurs concernant cette machine avec un message d'erreur indiquant que la machine n'est pas disponible.</p></td></tr><tr><td><p>1.5</p></td><td><p>Erreurs d'utilisation</p></td><td><p>Une requ&ecirc;te lanc&eacute;e avec des param&egrave;tres incorrects sera rejet&eacute;e par le syst&egrave;me Vishnu, et pour chaque param&egrave;re incorrect, le syst&egrave;me Vishnu indiquera le motif du rejet. Le syst&egrave;me Vishnu indiquera &agrave; l'utilisateur l'utilisation correcte de la requ&ecirc;te avec les bons param&egrave;tres.</p></td></tr><tr><td><p>1.6</p></td><td><p>Erreurs dues &agrave; l'intergiciel</p></td><td><p>Lorsqu'un processus serveur fournissant un service de l'intergiciel Vishnu crashe pendant l'ex&eacute;cution de ce service le syst&egrave;me Vishnu informe l'utilisateur de l'arr&ecirc;t de ce service par un message d'erreur ou une exception. Dans le cas d'un appel de service asynchrone, apr&egrave;s que la requ&ecirc;te utilisateur a &eacute;t&eacute; lanc&eacute;e, un arr&ecirc;t du service ne sera pas signal&eacute; &agrave; l'utilisateur. Si le service est red&eacute;marr&eacute; avant une requ&ecirc;te d'interrogation de l'utilisateur alors l'utilisateur recevra des informations sur l'&eacute;tat de ses requ&ecirc;tes sans &ecirc;tre inform&eacute; de l'arr&ecirc;t temporaire du service.</p></td></tr><tr><td><p>1.7</p></td><td><p>Erreurs dues aux droits d'acc&egrave;s</p></td><td><p>L'acc&egrave;s &agrave; certaines informations n&eacute;cessite des permissions en lecture ou &eacute;criture. Si un utilisateur n'a pas les droits n&eacute;cessaires pour acc&eacute;der &agrave; ces informations, le syst&egrave;me Vishnu l'en informera par un message indiquant la nature de la permission manquante et l'objet concern&eacute;.</p></td></tr><tr><td><p>2</p></td><td><p>Capacit&eacute;</p></td><td>&nbsp;</td></tr><tr><td><p>2.1</p></td><td><p>Nombre de requ&ecirc;tes simultan&eacute;es</p></td><td><p>Le syst&egrave;me pourra supporter au minimum 100 requ&ecirc;tes simultan&eacute;es. </p></td></tr><tr><td><p>2.2</p></td><td><p>Nombre d'utilisateurs</p></td><td><p>Le syst&egrave;me pourra supporter au minimum 1000 utilisateurs enregistr&eacute;s.</p></td></tr><tr><td><p>2.3</p></td><td><p>Nombre de machines serveur</p></td><td><p>Le syst&egrave;me pourra supporter au minimum 10 machines serveurs (supercalculateurs ou frontales de cluster)</p></td></tr><tr><td><p>2.4</p></td><td><p>Nombre de machines clientes</p></td><td><p>Le syst&egrave;me pourra supporter au minimum 1000 machines clientes (postes scientifiques)</p></td></tr><tr><td><p>3</p></td><td><p>Performance</p></td><td>&nbsp;</td></tr><tr><td><p>3.1</p></td><td><p>Latence</p></td><td><p>En fonctionnement normal (ressources des machines non satur&eacute;es), avec l'interface d'utilisation en ligne de commande, la latence sera inf&eacute;rieure ou &eacute;gale &agrave; celle obtenue par une commande ssh ayant le m&ecirc;me effet en termes de soumission de job ou transfert de fichiers.</p></td></tr><tr><td><p>3.2</p></td><td><p>Consommation de ressources</p></td><td>&nbsp;</td></tr><tr><td><p>3.2.1</p></td><td><p>Consommation m&eacute;moire moyenne des processus VISHNU</p></td><td><p>La consommation moyenne des processus VISHNU ne devra pas d&eacute;passer 500Mb de m&eacute;moire virtuelle </p></td></tr><tr><td><p>3.2.2</p></td><td><p>Consommation CPU moyenne des processus VISHNU</p></td><td><p>La consommation CPU des processus VISHNU ne devra pas d&eacute;passer 10% lorsque le syst&egrave;me n'est pas soumis &agrave; des requ&ecirc;tes utilisateur (la consommation &eacute;tant essentiellement d&ucirc;e aux processus de supervision)</p></td></tr><tr><td><p>3.2.3</p></td><td><p>Consommation ponctuelle pour l'ex&eacute;cution d'une requ&ecirc;te utilisateur</p></td><td><p>L'utilisation de Vishnu pour ex&eacute;cuter des requ&ecirc;tes sur un gestionnaire de jobs (soumission de job ou interrogation) ne devra pas consommer en moyenne davantage de ressources sur le serveur que l'utilisation d'un client en ligne de commande (client "lourd" du gestionnaire de jobs).</p></td></tr><tr><td><p>4</p></td><td><p>Robustesse</p></td><td>&nbsp;</td></tr><tr><td><p>4.1</p></td><td><p>Absence de plantage intempestif</p></td><td><p>Les processus du syst&egrave;me ne doivent pas s'interrompre en fonctionnement "de croisi&egrave;re" (c'est-&agrave;-dire hors de toute d&eacute;faillance logicielle ou mat&eacute;rielle du syst&egrave;me h&ocirc;te).</p></td></tr><tr><td><p>4.2</p></td><td><p>R&eacute;sistance aux d&eacute;faillances</p></td><td><p>Le syst&egrave;me doit rester disponible en cas de d&eacute;faillance de l'infrastructure n'affectant pas la connection de l'utilisateur aux point(s) d'entr&eacute;e du syst&egrave;me. Plusieurs points d'entr&eacute;e pourront &ecirc;tre configur&eacute;s mais le nombre de processus lanc&eacute;s par le syst&egrave;me sur les machines sera alors augment&eacute;.</p></td></tr><tr><td><p>4.3</p></td><td><p>D&eacute;lestage</p></td><td><p>Le d&eacute;lestage permettra &agrave; un administrateur de r&eacute;duire de mani&egrave;re imm&eacute;diate la charge g&eacute;n&eacute;r&eacute;e par l'intergiciel sur une machine de l'infrastructure. Deux niveaux de d&eacute;lestage seront possible.</p></td></tr><tr><td><p>4.3.1</p></td><td><p>D&eacute;lestage "soft"</p></td><td><p>Au niveau "soft", le d&eacute;lestage interrompra les activit&eacute;s en cours sur la machine concern&eacute;e (activit&eacute;s contr&ocirc;l&eacute;es par le syst&egrave;me Vishnu uniquement). Ces activit&eacute;s pourront &ecirc;tre relanc&eacute;es par le syst&egrave;me lors de la commande de fin de d&eacute;lestage execut&eacute;e par l'administrateur.</p></td></tr><tr><td><p>4.3.2</p></td><td><p>D&eacute;lestage "hard"</p></td><td><p>Au niveau "hard", le d&eacute;lestage interrompra tous les processus de l'intergiciel sur la machine concern&eacute;e sans effectuer d'actions &eacute;ventuellement n&eacute;cessaires &agrave; leur red&eacute;marrage. Le red&eacute;marrage de Vishnu sur la machine utilisera la m&ecirc;me proc&eacute;dure qu'un d&eacute;marrage "&agrave; froid" standard.</p></td></tr></tbody></table>
      </div>
    </div>
    <div class="section" title="Glossaire"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="N208C3"></a>Glossaire</h2></div></div></div>
      
      <div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
            <p>Aucun terme &agrave; d&eacute;finir</p>
          </li></ul></div>
    </div>
  </div>
</div></body></html>